Tekla Open API Reference for Tekla Structures 2025
Plane Class
 The Plane class defines a plane in space using an origin, an X-axis and a Y-axis.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Plane
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Plane
<SerializableAttribute>
Public NotInheritable Class Plane
The Plane type exposes the following members.
Constructors
Name | Description
Plane
 Initializes a new plane instance.
Top
Properties
Name | Description
AxisX
 The X-axis of the plane.
AxisY
 The Y-axis of the plane.
Origin
 The origin of the plane.
Top
Examples
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
       public void Example1()
       {
           Plane Plane = new Plane();
           Plane.Origin = new Point(500, 0, 0);
           Plane.AxisX = new Vector(500, 1000, 0);
           Plane.AxisY = new Vector(500, 0, -1000);
       }
}
See Also
Reference
Tekla.Structures.Model Namespace